{
  "aboutMe": {
    "imageUrl": "/profile-logo.svg",
    "title": "About Me",
    "subtitle": "Innovator & Problem Solver",
    "description": "A highly motivated and results-oriented Staff Software Engineer with 5+ years of experience, a strong foundation in full-stack development, and a passion for creating innovative and impactful solutions. Proven ability to lead technical initiatives, drive significant improvements in system performance and security, and effectively collaborate within agile environments. Eager to leverage expertise in cutting-edge technologies to contribute to challenging and rewarding projects."
  },
  "header": {
    "logoUrl": "/logo.svg"
  },
  "gauntletVisual": {
    "profileImageUrl": "/profile.jpeg"
  },
  "skillCategories": [
    {
      "categoryName": "Languages",
      "skills": [
        { "name": "TypeScript" },
        { "name": "HTML5" },
        { "name": "CSS" },
        { "name": "JavaScript" }
      ]
    },
    {
      "categoryName": "Frameworks & Libraries",
      "skills": [
        { "name": "React.js" },
        { "name": "Tailwind" },
        { "name": "React + Hooks" },
        { "name": "Redux" },
        { "name": "SASS" },
        { "name": "MUI" },
        { "name": "Storybook" },
        { "name": "Vite" },
        { "name": "Node.js" },
        { "name": "Express.js" }
      ]
    },
    {
      "categoryName": "Tools",
      "skills": [
        { "name": "Git" },
        { "name": "Webpack" },
        { "name": "Babel" },
        { "name": "Vite" },
        { "name": "Vitest" },
        { "name": "Jest" },
        { "name": "React Testing Library" },
        { "name": "Mocha" },
        { "name": "NX" },
        { "name": "Jenkins" },
        { "name": "NGINX" }
      ]
    },
    {
      "categoryName": "Databases",
      "skills": [{ "name": "MongoDB" }, { "name": "SQL" }]
    },
    {
      "categoryName": "Platforms",
      "skills": [
        { "name": "Amazon Web Services (S3, EC2, Lambda, Bedrock, Amplify)" },
        { "name": "Docker" },
        { "name": "Firebase" }
      ]
    }
  ],
  "projects": [
    {
      "title": "DCP AI Summarization Tool",
      "description": "Led the creation of an AI-powered tool using AWS Bedrock Agents to dynamically analyze reports from OpenSearch, generate actionable insights, and enable interactive follow-up.",
      "technologies": [
        "AWS Bedrock Agents",
        "OpenSearch",
        "React",
        "TypeScript",
        "Orion (Internal Design System)",
        "Vite",
        "Vitest",
        "Jest",
        "React Testing Library",
        "Mocha",
        "NX",
        "Jenkins",
        "NGINX"
      ]
    },
    {
      "title": "Safe Mode Feature",
      "description": "Developed a critical \"Safe Mode\" feature allowing for rapid containment of security incidents through immediate restriction of key operations, significantly reducing response time.",
      "technologies": [
        "React",
        "TypeScript",
        "Orion (Internal Design System)",
        "Vite",
        "Jest",
        "React Testing Library",
        "NX",
        "Jenkins",
        "NGINX"
      ]
    },
    {
      "title": "Microsoft Dynamics 365 Support",
      "description": "Developed end-to-end support for Microsoft Dynamics 365, a high-priority feature for a key customer.",
      "technologies": [
        "React",
        "TypeScript",
        "Orion (Internal Design System)",
        "Vite",
        "Jest",
        "React Testing Library",
        "NX",
        "Jenkins",
        "NGINX"
      ]
    },
    {
      "title": "HIPAA-Compliant Healthcare Website",
      "description": "Developed a secure and scalable healthcare website with a ReactJS frontend and a Node.js/Express.js backend, including patient data management, appointment scheduling, and secure communication, integrated with MongoDB and SQL databases.",
      "technologies": [
        "React",
        "TypeScript",
        "Jest",
        "React Testing Library",
        "MongoDB",
        "Node.js",
        "Express.js"
      ]
    }
  ],
  "experience": [
    {
      "role": "Staff Software Engineer",
      "company": "Druva",
      "duration": "April 2022 - Present",
      "achievements": [
        "Leading the creation of a DCP AI Summarization tool using AWS Bedrock Agents to dynamically analyze reports from OpenSearch, generate insights, and enable interactive follow-up.",
        "Developing a 'Safe Mode' feature enabling rapid, user-initiated or support-assisted containment of security incidents through immediate restriction of key operations (backup/restore, login/API access), reducing the current 12-48 hour response cycle.",
        "Proactively resolved critical Upguard escalations by researching and implementing nonce/SHA strategies and addressing HSTS preload requirements, which involved identifying and initiating remediation for 489 subdomains across the organization running on port 80 (recognized with a spot award for this impactful contribution).",
        "Developed Microsoft Dynamics 365 support, a high-priority feature personally committed by the CEO to a key customer, strategically positioning Druva to capitalize on the high-growth, $5B Dynamics 365 market (with 43% of customers in the USA and a strong presence in mid-sized and large enterprises) by offering unified protection for Microsoft cloud workloads.",
        "Architected a performant, iframe-based login application, empowering marketing to independently manage promotional content and enhance customer engagement.",
        "Developed product-led growth experience, enabling customers to explore and try products independently, bypassing traditional sales channels which led to 500+ trials.",
        "Developed and implemented foundational architectural improvements including unified common API services (streamlining maintenance and enabling rapid security updates), a complex state machine for seamless self-service delivery of security add-ons, URL-based restrictions via NGINX redirection, and an MFA mandate for Fedramp and FIPS compliance.",
        "Developed a reusable number text component adopted across all product teams, enhancing the in-house design library, and led the Low-Level Design of dashboard charts using Amcharts for Enterprise workloads backup, resulting in improved data visualization for multiple customer types.",
        "Revamped dashboard application by migrating it to TypeScript, resulting in a 50% reduction in loading time and improved code maintainability.",
        "Developed Multi-Factor Authentication (MFA) features, including Email, TOTP, and SMS, for enhanced security.",
        "Utilized Webpack Module Federation to create a React microfrontend sidebar, improving feature delivery time by 75%.",
        "Implemented unit tests using Jest and React Testing Library, achieving 88% test coverage across projects.",
        "Resolved 250+ critical and blocker bugs, enhancing application stability and user experience.",
        "Developed a robust state management solution leveraging Xstate features, ensuring application stability and consistency."
      ]
    },
    {
      "role": "System Engineer",
      "company": "Infosys",
      "duration": "February 2020 - March 2022",
      "achievements": [
        "Developed a HIPAA-compliant healthcare website with a ReactJS frontend (ReactJS) and a scalable Node.js/Express.js backend.",
        "Designed and implemented a scalable backend architecture for a healthcare website using Node.js and Express.js.",
        "Developed a comprehensive business logic layer to handle complex healthcare workflows, including patient data management, appointment scheduling, and secure communication between patients and providers.",
        "Integrated MongoDB and SQL databases for flexible and structured data storage, implementing stringent security measures."
      ]
    }
  ],
  "socialLinks": [
    {
      "name": "LinkedIn",
      "url": "https://linkedin.com/in/devamitranjan",
      "iconClass": "fab fa-linkedin"
    },
    {
      "name": "GitHub",
      "url": "https://github.com/devamitranjan",
      "iconClass": "fab fa-github"
    }
  ],
  "resume": {
    "url": "/resume.pdf",
    "downloadName": "AmitRanjan-Resume.pdf"
  },
  "contact": {
    "scheduleLink": "https://calendar.app.google/AfDLK6xo9aJr7o6o8"
  }
}
